---
type: StructuralConnectionSettings
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralConnectionSettings

`Autodesk.Revit.DB.Structure.StructuralConnectionSettings` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetStructuralConnectionSettings | 2017 | `public static StructuralConnectionSettings GetStructuralConnectionSettings ( Document document )` |
| Property | IncludeWarningControls | 2017 | `public bool IncludeWarningControls { get ; set ; }` |
| Property | Parameter | — | `` |